In [1]:
import numpy as np
import pandas as pd
from wrangle1 import wrangle_telco
import os

In [3]:
df = wrangle_telco()

In [4]:
df

             monthly_charges  tenure  total_charges
customer_id
0013-SMEOE            109.70      71        7904.25
0014-BMAQU             84.65      63        5377.80
0016-QLJIS             90.45      65        5957.90
0017-DINOC             45.20      54        2460.55
0017-IUDMW            116.80      72        8456.75
...                      ...     ...            ...
9964-WBQDJ             24.40      71        1725.40
9972-EWRJS             19.25      67        1372.90
9975-GPKZU             19.75      46         856.50
9993-LHIEB             67.85      67        4627.65
9995-HOTOH             59.00      63        3707.60

[1685 rows x 3 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1685 entries, 0013-SMEOE to 9995-HOTOH
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   monthly_charges  1685 non-null   float64
 1   tenure           1685 non-null   int64
 2   total_charges    1685 non-null   float64
dtypes: float64(2), int64(1)
memory usage: 52.7+ KB

In [6]:
df.head()

             monthly_charges  tenure  total_charges
customer_id
0013-SMEOE            109.70      71        7904.25
0014-BMAQU             84.65      63        5377.80
0016-QLJIS             90.45      65        5957.90
0017-DINOC             45.20      54        2460.55
0017-IUDMW            116.80      72        8456.75

In [7]:
df.shape

(1685, 3)

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
monthly_charges,1685.0,60.872374,34.712210,18.40,24.05,64.45,90.55,118.75
tenure,1685.0,57.071810,17.729130,1.00,48.00,64.00,71.00,72.00
total_charges,1685.0,3728.933947,2571.252806,20.35,1278.80,3623.95,5999.85,8672.45

### Acquire and Summarize Takeaways

No null values

Two obj, one float and one int

## Preparation

Double check for null values

In [9]:
# Checking for any null values
df.isnull().any()

monthly_charges    False
tenure             False
total_charges      False
dtype: bool